src/Catalogs/кфкТипыДанныхСпецификации/кфкТипыДанныхСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкТипыДанныхСпецификации</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.кфкСпецификации</owners>
  <attributes>
    <name>Описание</name>
    <comment>description</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДанных</name>
    <comment>type</comment>
    <type>
      <types>CatalogRef.кфкТипыЗначенийСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматДанных</name>
    <comment>format</comment>
    <type>
      <types>CatalogRef.кфкТипыЗначенийСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>Минимум</name>
    <comment>minimum|minLength|minItems</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>31</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Максимум</name>
    <comment>maximum|maxLength|maxItems</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>31</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перечисление</name>
    <comment>enum</comment>
    <type>
      <types>CatalogRef.кфкПеречисленияСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>РегулярноеВыражение</name>
    <comment>pattern</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Устарело</name>
    <comment>deprecated</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Обязательное</name>
    <comment>required</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <comment>default</comment>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>31</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектКонфигурации</name>
    <type>
      <types>CatalogRef.Свойства</types>
      <types>CatalogRef.Объекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>БазовыеТипы</name>
    <comment>$ref|allOf</comment>
    <attributes>
      <name>Тип</name>
      <type>
        <types>CatalogRef.кфкТипыДанныхСпецификации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/ТипыОбъектов/ТипыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b00d3374-fba3-4dfd-a8b9-2e9192589501">
  <name>ТипыОбъектов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="9a8e9e82-d92a-4009-b106-ec0dad7bbfdc">
    <name>БизнесПроцесс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="28f6293b-0a76-4f8d-b741-d6a86e461c95">
    <name>Булево</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c96f080e-8e03-46df-92cf-899101180ccb">
    <name>Строка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="52776854-ef3f-4d53-9b46-b1f5921f3db5">
    <name>Число</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="85dae71e-5343-4aa2-ad48-5bafd0e77bf1">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0ef44e26-9f8a-4f9f-af9f-b045c498816a">
    <name>ХранилищеЗначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="edc93a94-df17-4565-a085-b9635011d6e4">
    <name>УникальныйИдентификатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3cc366d1-dec6-4c40-bc75-a26c1cc4d307">
    <name>Перечисление</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e59131cc-796f-4a59-b508-b7116216ed5f">
    <name>ЛюбаяСсылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="61c264b5-4a1a-4a85-9134-71d05b5ef74f">
    <name>Справочник</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f39eb3b4-764d-4e49-9149-79a08def2a0e">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b3b69793-028f-4701-963c-d2e5302d5e7b">
    <name>ПланВидовРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3817b5d5-5de7-4f12-85c4-5037b01e683d">
    <name>ПланВидовХарактеристик</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e46ff655-d737-4f7e-99a8-70bdd157c150">
    <name>ПланОбмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="556282ca-df4a-4d71-b417-48193ff98076">
    <name>ПланСчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="666398bf-eff8-4172-9c11-f7e1a1382499">
    <name>ТочкаМаршрутаБизнесПроцесса</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d4ec2030-fa42-4716-a9e9-87a282796ebb">
    <name>Задача</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="bf7d940d-ea2d-4e76-9a9b-17544835afee">
    <name>ВидРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b65ce0b2-9d46-44a6-8beb-4b6114c07627">
    <name>ВидСубконто</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/Catalogs/кфкТипыЗначенийСпецификации/кфкТипыЗначенийСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкТипыЗначенийСпецификации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Строка</name>
      <description>Строка</description>
    </items>
    <items>
      <name>Число</name>
      <description>Число</description>
    </items>
    <items>
      <name>ЦелоеЧисло</name>
      <description>Целое число</description>
    </items>
    <items>
      <name>Логический</name>
      <description>Логический</description>
    </items>
    <items>
      <name>Массив</name>
      <description>Массив</description>
    </items>
    <items>
      <name>Структура</name>
      <description>Структура</description>
    </items>
  </predefined>
</mdclass:Catalog>

src/Catalogs/кфкПеречисленияСпецификации/кфкПеречисленияСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкПеречисленияСпецификации</name>
  <owners>Catalog.кфкСпецификации</owners>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>CatalogRef.кфкТипыЗначенийСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектКонфигурации</name>
    <type>
      <types>CatalogRef.Объекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Значения</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>31</precision>
          <scale>4</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/кфкТипыДанныхСпецификации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Код");
	Поля.Добавить("Наименование");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = СтрШаблон("%1 (%2)", Данные.Код, Данные.Наименование);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру с описанием типа данных
// 
// Параметры:
//	Ссылка - СправочникСсылка.кфкТипыДанныхСпецификации - Ссылка
// 
// Возвращаемое значение:
//	Структура - Описание типа:
//		* Ссылка - СправочникСсылка.кфкТипыДанныхСпецификации - Ссылка
//		* Владелец - СправочникСсылка.кфкСпецификации - Владелец
//		* Родитель - СправочникСсылка.кфкТипыДанныхСпецификации - Родитель
//		* Код - Строка - Код
//		* Наименование - Строка - Наименование
//		* ПометкаУдаления - Булево - ПометкаУдаления
//		* Описание - Строка - Описание
//		* ТипДанных - СправочникСсылка.кфкТипыЗначенийСпецификации - ТипДанных
//		* ФорматДанных - СправочникСсылка.кфкТипыЗначенийСпецификации - ФорматДанных
//		* Минимум - Число - Минимум
//		* Максимум - Число - Максимум
//		* Перечисление - СправочникСсылка.кфкПеречисленияСпецификации - Перечисление
//		* РегулярноеВыражение - Строка - РегулярноеВыражение
//		* Устарело - Булево - Устарело
//		* Обязательное - Булево - Обязательное
//		* ЗначениеПоУмолчанию - Неопределено,Строка,Число,Дата,Булево - ЗначениеПоУмолчанию
//		* ОбъектКонфигурации - Неопределено,СправочникСсылка.Объекты, СправочникСсылка.Свойства - Объект или свойство конфигурации
//		* БазовыеТипы - ФиксированныйМассив Из СправочникСсылка.кфкТипыДанныхСпецификации - Базовые типы
//		* БазовыеТипыСтрокой - Строка - Базовые типы в виде строки
Функция ОписаниеТипа(Ссылка) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка", ПустаяСсылка());
	Результат.Вставить("ПометкаУдаления", Ложь);
	Результат.Вставить("Владелец", Справочники.кфкСпецификации.ПустаяСсылка());
	Результат.Вставить("Родитель", ПустаяСсылка());
	Результат.Вставить("Код", "");
	Результат.Вставить("Наименование", "");
	Результат.Вставить("Описание", "");
	Результат.Вставить("ТипДанных", Справочники.кфкТипыЗначенийСпецификации.ПустаяСсылка());
	Результат.Вставить("ФорматДанных", Справочники.кфкТипыЗначенийСпецификации.ПустаяСсылка());
	Результат.Вставить("Минимум", 0);
	Результат.Вставить("Максимум", 0);
	Результат.Вставить("Перечисление", Справочники.кфкПеречисленияСпецификации.ПустаяСсылка());
	Результат.Вставить("РегулярноеВыражение", "");
	Результат.Вставить("Устарело", Ложь);
	Результат.Вставить("Обязательное", Ложь);
	Результат.Вставить("ЗначениеПоУмолчанию", Неопределено);
	Результат.Вставить("ОбъектКонфигурации", Неопределено);
	Результат.Вставить("БазовыеТипы", Новый ФиксированныйМассив(Новый Массив));
	Результат.Вставить("БазовыеТипыСтрокой", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	Т.ПометкаУдаления КАК ПометкаУдаления,
	|	Т.Владелец КАК Владелец,
	|	Т.Родитель КАК Родитель,
	|	Т.Код КАК Код,
	|	Т.Наименование КАК Наименование,
	|	Т.Описание КАК Описание,
	|	Т.ТипДанных КАК ТипДанных,
	|	Т.ФорматДанных КАК ФорматДанных,
	|	Т.Минимум КАК Минимум,
	|	Т.Максимум КАК Максимум,
	|	Т.Перечисление КАК Перечисление,
	|	Т.РегулярноеВыражение КАК РегулярноеВыражение,
	|	Т.Устарело КАК Устарело,
	|	Т.Обязательное КАК Обязательное,
	|	Т.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
	|	Т.ОбъектКонфигурации КАК ОбъектКонфигурации
	|ИЗ
	|	Справочник.кфкТипыДанныхСпецификации КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Тип КАК Тип
	|ИЗ
	|	Справочник.кфкТипыДанныхСпецификации.БазовыеТипы КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Если Выборка.Следующий() Тогда
		
		// Описание элемента
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
		// ТЧ БазовыеТипы
		Если Выборка.ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Структура Тогда
			
			БазовыеТипы = Новый Массив;
			БазовыеТипыСтрокой = Новый Массив;
			
			ВыборкаБазовыеТипы = РезультатЗапроса[1].Выбрать();
			Пока ВыборкаБазовыеТипы.Следующий() Цикл
				БазовыеТипы.Добавить(ВыборкаБазовыеТипы.Тип);
				БазовыеТипыСтрокой.Добавить(ОбщегоНазначения.СтроковоеПредставлениеТипа(ВыборкаБазовыеТипы.Тип));
			КонецЦикла;
			
			Результат.БазовыеТипы = Новый ФиксированныйМассив(БазовыеТипы);
			Результат.БазовыеТипыСтрокой = СтрСоединить(БазовыеТипы, ",");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает подчиненные элементы справочника
// 
// Параметры:
//	Родитель - СправочникСсылка.кфкТипыДанныхСпецификации - Родитель
// 
// Возвращаемое значение:
//	ДеревоЗначений - Подчинные элементы:
//		* Ссылка - СправочникСсылка.кфкТипыДанныхСпецификации - Ссылка
//		* Владелец - СправочникСсылка.кфкСпецификации - Владелец
//		* Родитель - СправочникСсылка.кфкТипыДанныхСпецификации - Родитель
//		* Код - Строка - Код
//		* Наименование - Строка - Наименование
//		* ПометкаУдаления - Булево - ПометкаУдаления
//		* Описание - Строка - Описание
//		* ТипДанных - СправочникСсылка.кфкТипыЗначенийСпецификации - ТипДанных
//		* ФорматДанных - СправочникСсылка.кфкТипыЗначенийСпецификации - ФорматДанных
//		* Минимум - Число - Минимум
//		* Максимум - Число - Максимум
//		* Перечисление - СправочникСсылка.кфкПеречисленияСпецификации - Перечисление
//		* РегулярноеВыражение - Строка - РегулярноеВыражение
//		* Устарело - Булево - Устарело
//		* Обязательное - Булево - Обязательное
//		* ЗначениеПоУмолчанию - Строка,Число,Дата,Булево - ЗначениеПоУмолчанию
//		* ОбъектКонфигурации - СправочникСсылка.Объекты, СправочникСсылка.Свойства - Объект или свойство конфигурации
//		* БазовыеТипы - ФиксированныйМассив Из СправочникСсылка.кфкТипыДанныхСпецификации - Базовые типы
//		* БазовыеТипыСтрокой - Строка - Базовые типы в виде строки
Функция ПодчинныеЭлементы(Родитель) Экспорт
	
	Результат = Новый ДеревоЗначений;
	// Создаем колонки дерева значений
	ОбъектМетаданных = Метаданные.Справочники.кфкТипыДанныхСпецификации;
	Для Каждого ИмяРеквизита Из СтрРазделить("Ссылка,Владелец,Родитель,Код,Наименование,ПометкаУдаления", ",") Цикл
		Результат.Колонки.Добавить(ИмяРеквизита, ОбъектМетаданных.СтандартныеРеквизиты[ИмяРеквизита].Тип);
	КонецЦикла;
	Для Каждого Реквизит Из Метаданные.Справочники.кфкТипыДанныхСпецификации.Реквизиты Цикл
		Результат.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);
	КонецЦикла;
	Результат.Колонки.Добавить("БазовыеТипы", Новый ОписаниеТипов("ФиксированныйМассив"));
	Результат.Колонки.Добавить("БазовыеТипыСтрокой", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	
	ДобавитьПодчиненныеЭлементы(Родитель, Результат.Строки);
	
	Возврат Результат;
	
КонецФункции

// Создает свойства типа данных
// 
// Параметры:
//	Владелец - СправочникСсылка.кфкСпецификации - Владелец
//	ТипДанных - СправочникСсылка.кфкТипыДанныхСпецификации - Тип данных
//	Дерево - ДеревоЗначений - Дерево свойств:
//		* Добавить - Число - Признак добавления свойства, 0 - не добавлять, 1 - добавить всю цепочку, 2 - добавить часть подчиненных элементов
//		* СвойствоКонфигурации - СправочникСсылка.Свойства - Свойство конфигурации
//		* СвойствоКонфигурацииНаименование - Строка - Наименование свойства конфигурации
//		* СвойствоКонфигурацииСиноним - Строка - Синоним свойства конфигурации
//		* ТипСвойстваКонфигурации - СправочникСсылка.Объекты - Тип свойства конфигурации
//		* ТипОбъекта - ПеречислениеСсылка.ТипыОбъектов - Тип объекта
//		* Свойство - Строка - Свойство
//		* ТипДанных - СправочникСсылка.кфкТипыЗначенийСпецификации - Тип данных
//		* ФорматДанных - СправочникСсылка.кфкТипыЗначенийСпецификации - Формат данных
//		* Перечисление - СправочникСсылка.кфкПеречисленияСпецификации - Перечисление
//		* Минимум - Число - Минимум
//		* Максимум - Число - Максимум
//		* Ссылка - СправочникСсылка.кфкТипыДанныхСпецификации - Ссылка
// 
// Возвращаемое значение:
//	Структура - Результат создания свойств:
//		* Успешно - Булево - Признак успешного создания свойств
//		* ТекстОшибки - Строка - Текст ошибки
Функция СоздатьСвойства(Владелец, ТипДанных, Дерево) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успешно", Истина);
	Результат.Вставить("ТекстОшибки", "");
	
	ПеречисленияСпецификации = Новый Соответствие;
	
	НачатьТранзакцию();
	Попытка
		
		Для Каждого Строка Из Дерево.Строки Цикл
			
			Если Строка.Добавить = 0 Тогда
				Продолжить;
				
			ИначеЕсли Строка.ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Массив Тогда // Табличная часть
				Родитель = ДобавитьСвойствоТипаДанных(Владелец, ТипДанных, Строка, ПеречисленияСпецификации);
				Для Каждого СтрокаТЧ Из Строка.Строки Цикл
					Если Строка.Добавить = 1 Тогда
						ДобавитьСвойствоТипаДанных(Владелец, Родитель, СтрокаТЧ, ПеречисленияСпецификации);
					КонецЕсли;
				КонецЦикла;
				
			Иначе
				ДобавитьСвойствоТипаДанных(Владелец, ТипДанных, Строка, ПеречисленияСпецификации);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Результат.Успешно = Ложь;
		Результат.ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПодчиненныеЭлементы(Родитель, Строки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	Т.ПометкаУдаления КАК ПометкаУдаления,
	|	Т.Владелец КАК Владелец,
	|	Т.Родитель КАК Родитель,
	|	Т.Код КАК Код,
	|	Т.Наименование КАК Наименование,
	|	Т.Описание КАК Описание,
	|	Т.ТипДанных КАК ТипДанных,
	|	Т.ФорматДанных КАК ФорматДанных,
	|	Т.Минимум КАК Минимум,
	|	Т.Максимум КАК Максимум,
	|	Т.Перечисление КАК Перечисление,
	|	Т.РегулярноеВыражение КАК РегулярноеВыражение,
	|	Т.Устарело КАК Устарело,
	|	Т.Обязательное КАК Обязательное,
	|	Т.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
	|	Т.ОбъектКонфигурации КАК ОбъектКонфигурации
	|ИЗ
	|	Справочник.кфкТипыДанныхСпецификации КАК Т
	|ГДЕ
	|	Т.Родитель = &Родитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВЫБОР
	|		КОГДА Т.ТипДанных = ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Массив)
	|			ТОГДА 3
	|		КОГДА Т.ТипДанных = ЗНАЧЕНИЕ(Справочник.кфкТипыЗначенийСпецификации.Структура)
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т2.Ссылка КАК Ссылка,
	|	Т2.Тип КАК Тип
	|ИЗ
	|	Справочник.кфкТипыДанныхСпецификации КАК Т1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.кфкТипыДанныхСпецификации.БазовыеТипы КАК Т2
	|		ПО Т1.Ссылка = Т2.Ссылка
	|ГДЕ
	|	Т1.Родитель = &Родитель";
	Запрос.УстановитьПараметр("Родитель", Родитель);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаБазовыеТипы = РезультатЗапроса[1].Выбрать();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	//@skip-check query-in-loop
	Пока Выборка.Следующий() Цикл
		
		// Описание элемента
		НоваяСтрока = Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Если Выборка.ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Массив Тогда
			// Вложенные элементы
			ДобавитьПодчиненныеЭлементы(Выборка.Ссылка, НоваяСтрока.Строки);
			
		ИначеЕсли Выборка.ТипДанных = Справочники.кфкТипыЗначенийСпецификации.Структура Тогда
			// Вложенные элементы
			ДобавитьПодчиненныеЭлементы(Выборка.Ссылка, НоваяСтрока.Строки);
			// Заполняем список базовых типов
			БазовыеТипы = Новый Массив;
			БазовыеТипыСтрокой = Новый Массив;
			ВыборкаБазовыеТипы = РезультатЗапроса[1].Выбрать();
			Пока ВыборкаБазовыеТипы.НайтиСледующий(Выборка.Ссылка, "Ссылка") Цикл
				БазовыеТипы.Добавить(ВыборкаБазовыеТипы.Тип);
				БазовыеТипыСтрокой.Добавить(ОбщегоНазначения.СтроковоеПредставлениеТипа(ВыборкаБазовыеТипы.Тип));
				// Вложенные элементы
				ДобавитьПодчиненныеЭлементы(ВыборкаБазовыеТипы.Тип, НоваяСтрока.Строки);
			КонецЦикла;
			НоваяСтрока.БазовыеТипы = Новый ФиксированныйМассив(БазовыеТипы);
			НоваяСтрока.БазовыеТипыСтрокой = СтрСоединить(БазовыеТипы, ",");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ДобавитьСвойствоТипаДанных(Владелец, Родитель, Реквизит, ПеречисленияСпецификации)
	
	Если ЗначениеЗаполнено(Реквизит.Ссылка) Тогда
		Возврат Реквизит.Ссылка;
	КонецЕсли;
	
	Если ПустаяСтрока(Реквизит.Свойство) Тогда
		ВызватьИсключение СтрШаблон("Не заполнено наименование свойства %1", Реквизит.СвойствоКонфигурации);
	КонецЕсли;
	
	Объект = СоздатьЭлемент();
	Объект.Владелец = Владелец;
	Объект.Родитель = Родитель;
	Объект.Код = Реквизит.Свойство;
	Объект.Наименование = Реквизит.СвойствоКонфигурацииНаименование;
	Объект.Описание = Реквизит.СвойствоКонфигурацииСиноним;
	Объект.ТипДанных = Реквизит.ТипДанных;
	Объект.ФорматДанных = Реквизит.ФорматДанных;
	Объект.Минимум = ?(Реквизит.Минимум = Неопределено, -1, Реквизит.Минимум);
	Объект.Максимум = ?(Реквизит.Максимум = Неопределено, -1, Реквизит.Максимум);
	
	Если Реквизит.ТипОбъекта = Перечисления.ТипыОбъектов.Перечисление Тогда
		Если Не ЗначениеЗаполнено(Реквизит.Перечисление) Тогда
//			Продолжить;
			
		ИначеЕсли ТипЗнч(Реквизит.Перечисление) = Тип("СправочникСсылка.кфкПеречисленияСпецификации") Тогда
			Объект.Перечисление = Реквизит.Перечисление;
			
		ИначеЕсли ТипЗнч(Реквизит.Перечисление) = Тип("СправочникСсылка.Свойства") Тогда
			Объект.Перечисление = ПеречисленияСпецификации.Получить(Реквизит.Перечисление);
			Если Не ЗначениеЗаполнено(Объект.Перечисление) Тогда
				Объект.Перечисление = Справочники.кфкПеречисленияСпецификации.Создать(
					Владелец, Реквизит.Перечисление, Реквизит.Свойство + "Enum");
				ПеречисленияСпецификации.Вставить(Реквизит.Перечисление, Объект.Перечисление);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Объект.ОбъектКонфигурации = Реквизит.СвойствоКонфигурации;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
